// rest является простенькой библиотекой для быстрого создания web API для
// проектов.
//
// Основные ее достоинства в том, что она достаточно компактная, облегчает
// некоторые часто используемые вещи, поддерживает параметры в пути, совместима
// со стандартной библиотекой http и позволяет описывать обработчики в таком
// виде, как удобно мне.
//
// Вообще, библиотека написана исключительно для внутреннего использования и
// нет никаких гарантий, что она не будет время от времени серьезно изменяться.
// Поэтому, если вы хотите использовать ее в своих проектах, то делайте fork и
// вперед.
package rest
